<?php
use yii\helpers\Html;

$this->title = "ข้อตกลงและเงื่อนไขการใช้บริการ";
?>

<div class="body-content">
    <main class="content_wrapper">
        <div class="container-fluid">
			<div class="sufee-login d-flex align-content-center flex-wrap">
				<div class="container">
					<div class="login-content">

						<div class="card-header text-white bg-danger border-0  text-center">
							<div class="media p-6">
								<div class="media-body">
									<p class="btn-flat m-b-30 m-t-30">
										<strong class="">
											<p style="font-size: 20pt;">
                                            ข้อตกลงและเงื่อนไขการใช้บริการจองคิว
                                            โรงพยาบาลอุดรธานี
                                            </p>
										</strong>
									</p>
								</div>
							</div>
						</div> 
					
						<div class="login-form">
							<form>
                                <p>
                                &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ข้อมูลของผู้ใช้บริการจะถูกนำมาใช้
                                        เฉพาะเพื่อให้บริการแก่ผู้ใช้บริการเท่านั้น
                                        รวมถึงเพื่อวัตถุประสงค์ที่สอดคล้องกับการให้บริการเหล่านั้น
                                        บริษัทจะไม่ใช้ข้อมูลผู้ใช้บริการหรือได้มาซึ่งข้อมูลจากข้อมูลผู้ใช้บริการเพื่อการโฆษณาใดๆ
                                        หรือวัตถุประสงค์เชิงพาณิชย์ในลักษณะเดียวกัน
                                        ผู้ใช้บริการจะคงไว้ซึ่งสิทธิ กรรมสิทธิ์ และผลประโยชน์ทั้งหมดในและที่มีกับข้อมูลของผู้ใช้บริการ
                                        บริษัทไม่ได้รับสิทธิใดๆ ในข้อมูลของผู้ใช้บริการนอกเหนือจากสิทธิที่ผู้ใช้บริการให้กับ บริษัทเพื่อให้บริการแก่ผู้ใช้บริการ
                                </p>
                                <ol>
                                    <li>
                                        ผู้ขอใช้ "บริการจองคิว ต้องเป็นเจ้าของบัญชี LINE และเป็นเพื่อนกับบัญชี UDH Connect"
                                    </li>
                                    <li>
                                        ผู้ขอใช้บริการต้องทำรายการ "บริการจองคิว" ผ่านบัญชี UDH Connect ของโรงพยาบาลอุดรธานี เท่านั้น
                                    </li>
                                    <li>
                                        ผู้ขอใช้ "บริการจองคิว" ตกลงและยอมรับว่า การกระทำใดๆ ผ่านบริการบน UDH Connect หากได้กระทำไปโดยผ่านบัญชี LINE 
                                        ตามข้อกำหนดและเงื่อนไขการให้บริการนี้แล้ว ถือว่าถูกต้องสมบูรณ์และผูกพัน ผู้ขอใช้บริการทุกประการ 
                                        โดยไม่ต้องลงลายมือชื่อในเอกสารใดๆ และตกลงรับผิดชอบ การกระทำดังกล่าว เสมือนว่าเป็นผู้กระทำด้วยตนเอง
                                    </li>
                                    <li>
                                        การใช้ "บริการจองคิว" บน UDH Connect ต้องยืนยันตัวตนโดยบันทึกข้อมูลตามหน้าจอลงทะเบียนแล้ว UDH Connect 
                                        จะนำข้อมูลที่บันทึก มาเข้ารหัสให้เป็น UDH User ID เพื่อจองคิว
                                    </li> 
                                    <li>
                                        ผู้ขอใช้ "บริการจองคิว" ควรตรวจสอบสิทธิการ รักษา จากหน้า "ตรวจสอบสิทธิ" ของ UDH Connect
                                        และใช้บริการจองคิวตามสิทธิประกันสุขภาพ เพื่อความสะดวก และใช้สิทธิเข้ารับบริการได้อย่างถูกต้อง
                                    </li>
                                    <li>
                                        ผู้ขอใช้ "บริการจองคิว" ต้องเคยเข้ารับการรักษา หรือมีประวัติเคยรับบริการที่โรงพยาบาลอุดรธานีมาก่อนแล้วเท่านั้น
                                    </li> 
                                    <li>
                                        ผู้ขอใช้ "บริการจองคิว" เข้าใจ และยินยอมให้ UDH Connect นำข้อมูลส่วนบุคคล ที่จำเป็น
                                        สำหรับการยืนยันตัวตน โดยไม่ใช้ LINE ID มาเข้า รหัสให้เป็น UDH User ID
                                    </li>        
                                    <li>
                                        ผู้ขอใช้ "บริการจองคิว" ยินยอมให้โรงพยาบาล ส่งข้อมูลที่เกี่ยวข้องกับการจองคิว
                                        เช่น ชื่อผู้ขอใช้บริการ ประเภทของคิวหรือข้อมูลอื่น ผ่านระบบแจ้งเตือนของ UDH Connect
                                    </li>        
                                </ol>

                                <?php
                                    echo Html::a('ยอมรับ', $url,['class'=>'btn btn-success btn-lg btn-block'] ); 
                                ?>
                          
							</form>
						</div>
						
					</div>
				</div>
			</div>
        </div>
    </main>
</div>